
// let user = +prompt("Введите число:")
// console.log(`10% от ${user} = ${user * 0.1})`)

// const num1 = +prompt("Введите первое число:")
// const num2 = +prompt("Введите второе число:")

// if(num1 < num2) {
//     console.log(num1)
// }else if(num1 > num2) {
//     console.log(num2)
// }else {
//     console.log("Числа равны")
// }

// const num = +prompt("Введите число:")

// if (num < 100) {
//     console.log("Число меньше 100")
// }else if (num > 100) {
//     console.log("Число больше 100") 
// }else {
//     console.log("Число равно 100")
// }    


const userName = prompt("Введите ваше имя:")
const age = +prompt("Введите ващ возраст:")

if(age > 18) {
    console.log(`Hello,  Mr.${userName}`)
}else {
    console.log(`Hi, ${userName}`)
}






// Написать программу, которая через prompt считывает число и выводит в консоль число равное 10% от введенного числа
// Написать программу, которая получает два числа и выводит наименьшее
// Написать программу, которая считывает через prompt число и выводит одно из следующих сообщений: ‘Число меньше 100’, ‘Число больше 100’ или ‘Число равно 100’
// Написать программу, которая запрашивает у пользователя его имя и возраст (в годах) и выводит в консоль сообщение ‘Hello, <name>’, если пользователь совершеннолетний, или ‘Hi, <name>’, если пользователь несовершеннолетний.
